{
  "personalInfo": {
    "name": "Akshay Vadchhak",
    "title": "Team Leader",
    "email": "akshayvadchhak101@gmail.com",
    "phone": "9574865235",
    "address": "170-Mohandip Society-11, Ambatalavadi, Surat, Gujarat, India",
    "linkedin": "https://www.linkedin.com/in/akshay-vadchhak-936b9920a/",
    "github": "",
    "summary": "Experienced Team Leader and Senior Android Engineer with 4+ years of expertise in native Android application development. Since February 2025, serving as a Team Leader, leading end-to-end Android projects and mentoring developers to deliver high-quality, scalable solutions. Proven track record in building high-performance mobile applications using Java, Android SDK, and modern architectural patterns such as MVVM and Clean Architecture. Skilled in integrating RESTful APIs, managing local databases (Room, SQLite), and optimizing app performance and UI/UX. Strong background in full-cycle Android development—from concept to deployment—with excellent problem-solving abilities, leadership skills, and a collaborative mindset."
  },
  "skills": {
    "languages": ["Java", "Kotlin", "XML", "C", "SQL"],
    "androidDevelopment": [
      "Android SDK",
      "Android Studio",
      "Gradle",
      "Jetpack Components",
      "Room Database",
      "LiveData",
      "ViewModel",
      "Data Binding",
      "RecyclerView",
      "ConstraintLayout"
    ],
    "architecture": ["MVVM", "MVP", "Clean Architecture"],
    "apiAndNetworking": [
      "RESTful APIs",
      "Retrofit",
      "Volley",
      "OkHttp",
      "JSON",
      "Gson"
    ],
    "tools": [
      "Git",
      "Bitbucket",
      "Firebase",
      "Postman",
      "Jira",
      "VS Code",
      "Android Debug Bridge (ADB)"
    ],
    "testing": ["JUnit", "Espresso", "Mockito"],
    "uiux": ["Material Design", "XML Layouts", "Custom Views", "Animations"],
    "other": [
      "Problem Solving",
      "Performance Optimization",
      "Play Store Deployment",
      "Version Control"
    ],
    "os": ["Windows", "macOS", "Linux"]
  },
  "experience": {
    "company": "Optimumbrew Technology",
    "position": "Senior Software Engineer",
    "duration": "November 2021 - Present",
    "responsibilities": [
      "Developed and maintained scalable native Android applications using Java and Android SDK",
      "Implemented clean architecture patterns such as MVVM and MVP for maintainable codebases",
      "Integrated RESTful APIs and handled data persistence using Room and SQLite",
      "Optimized app performance, memory usage, and battery efficiency",
      "Collaborated with designers and backend teams to deliver seamless user experiences",
      "Published and maintained applications on the Google Play Store"
    ],
    "achievements": [
      "Successfully delivered 4+ major Android applications from concept to deployment",
      "Improved app performance and load times by up to 30% through code optimization",
      "Developed and maintained apps collectively serving over 20 million users with high ratings on the Play Store",
      "Led code reviews, mentored junior developers, and ensured adherence to best practices",
      "Implemented CI/CD pipelines and automated builds using Gradle and Firebase tools"
    ]
  },
  "projects": [
  {
    "id": 1,
    "title": "Flyerwiz",
    "liveUrl": "https://play.google.com/store/apps/details?id=com.bg.flyermaker&hl=en",
    "teamSize": 1,
    "technologies": [
      "Java",
      "XML Layouts",
      "Android SDK",
      "Material Design Components",
      "Firebase",
      "SQLite",
      "Room Database",
      "RESTful APIs"
    ],
    "description": "Flyerwiz is a user-friendly and AI-powered flyer maker app that allows users to design professional-quality flyers, posters, banners, invitations, and social media graphics quickly and easily. The app includes over 30,000 customizable templates and AI-powered tools to simplify the design process.",
    "features": [
      "30,000+ ready-to-use templates for flyers, posters, banners, invitations, and social media graphics",
      "Templates covering 200+ industries and 500+ events & festivals",
      "Fully customizable with fonts, colors, stickers, backgrounds, shapes, and textures",
      "AI Flyer Generator for instant flyer creation with smart suggestions",
      "AI Background Remover for one-tap photo background replacement",
      "AI Listicle Content Writer for automatic poster and ad text generation",
      "Video Flyer Generation using Python-based API for animated content",
      "QR Code Generator for scannable flyer interactions",
      "Clickable links in exported PDFs for interactive digital sharing",
      "Branding tools to add logos, brand colors, and custom styles",
      "Export designs in multiple formats for print or digital use",
      "Direct social media sharing support",
      "Premium access to unlock all templates and AI tools"
    ],
    "responsibilities": [
      "Gathered requirements and conducted brainstorming sessions",
      "Developed responsive UI from Figma design using XML and Material Design",
      "Implemented RESTful APIs with Volley and integrated backend services",
      "Optimized code structure for better performance and scalability",
      "Performed bug fixing and content verification before release"
    ],
    "status": "Live"
  },
  {
    "id": 2,
    "title": "1Invites",
    "liveUrl": "https://play.google.com/store/apps/details?id=com.optimumbrewlab.invitationcardmaker&hl=en",
    "teamSize": 3,
    "technologies": [
      "Java",
      "XML Layouts",
      "Android SDK",
      "Material Design Components",
      "Firebase",
      "SQLite",
      "Room Database",
      "RESTful APIs"
    ],
    "description": "1Invites is a smart invitation and event management app offering over 20,000 customizable templates for weddings, birthdays, and corporate events. It simplifies event planning with RSVP tracking, guest list management, and interactive invitations.",
    "features": [
      "20,000+ ready-to-use invitation templates across multiple categories",
      "Fully customizable designs with fonts, colors, stickers, frames, and backgrounds",
      "RSVP and guest list management with event creation tools",
      "Embedded smart PDF links for maps, websites, and gift registries",
      "Export invitations via WhatsApp, email, and social media platforms",
      "Reminder notifications for pending RSVPs",
      "Simple and intuitive user flow for non-designers",
      "Premium features for ad-free experience and advanced templates"
    ],
    "responsibilities": [
      "Gathered requirements and collaborated in brainstorming sessions",
      "Developed responsive UIs from Figma designs",
      "Implemented REST APIs using Volley and integrated backend services",
      "Optimized code structure for improved performance and maintainability"
    ],
    "status": "Live"
  },
  {
    "id": 3,
    "title": "AI Logo Generator, Logo Maker",
    "liveUrl": "https://play.google.com/store/apps/details?id=com.bg.logomaker&hl=en",
    "teamSize": 2,
    "technologies": [
      "Java",
      "XML Layouts",
      "Android SDK",
      "Material Design Components",
      "Firebase",
      "SQLite",
      "Room Database",
      "RESTful APIs"
    ],
    "description": "AI Logo Generator (Logowiz) is an intuitive logo creation app that empowers users to design professional, scalable vector logos with ease. It includes a rich library of templates, customizable elements, and SVG export capabilities for digital and print-ready outputs.",
    "features": [
      "Customizable logo templates with fonts, colors, icons, and decorative elements",
      "SVG export for high-quality scalable vector logos",
      "Save and export designs in multiple formats for print or digital use",
      "Share directly to social media, email, or messaging apps",
      "User-friendly interface suitable for both beginners and professionals"
    ],
    "responsibilities": [
      "Gathered requirements and participated in brainstorming sessions",
      "Developed responsive UIs from Figma designs using XML layouts",
      "Implemented RESTful APIs using Volley",
      "Integrated backend services with Firebase and SQLite",
      "Optimized code structure for performance and maintainability"
    ],
    "status": "Live"
  },
  {
    "id": 4,
    "title": "Brochure Maker, Pamphlet Maker",
    "liveUrl": "https://play.google.com/store/apps/details?id=com.bg.brochuremaker&hl=en",
    "teamSize": 2,
    "technologies": [
      "Java",
      "XML Layouts",
      "Android SDK",
      "Material Design Components",
      "Firebase",
      "SQLite",
      "Room Database",
      "RESTful APIs"
    ],
    "description": "Brochure & Pamphlet Maker is a user-friendly Android app designed for creating professional brochures and pamphlets quickly and easily. It offers customizable templates and design tools, enabling users to create high-quality promotional materials without prior design experience.",
    "features": [
      "Pre-designed brochure and pamphlet templates",
      "Customizable layouts with text, images, and graphics",
      "Export designs for print or digital use",
      "Easy-to-use and responsive user interface"
    ],
    "responsibilities": [
      "Gathered requirements and contributed to brainstorming sessions",
      "Redesigned UI from Figma layouts to improve usability",
      "Integrated backend services and optimized application performance",
      "Ensured responsive and visually appealing user experience"
    ],
    "status": "Live"
  }
],
  "education": [
    {
      "degree": "Bachelor of Science (Information Technology)",
      "institution": "Bhagwan Mahavir College Of Computer Application - BMCCA, Surat",
      "university": "Bhagwan Mahavir University",
      "duration": "2019-2022",
      "cgpa": "8.12/10",
      "score": ""
    },
    {
      "degree": "Higher Secondary Certificate (HSC)",
      "institution": "Gujarat Higher Secondary Education Board",
      "duration": "2019",
      "score": ""
    },
    {
      "degree": "Secondary School Certificate (SSC)",
      "institution": "Gujarat Secondary Education Board",
      "duration": "2017",
      "score": ""
    }
  ],
  "internships": [
    {
      "company": "Optimumbrew Technology",
      "position": "Software Developer Intern",
      "description": "Gained hands-on experience in software development practices and methodologies"
    },
    {
      "company": "VPN Infotech",
      "position": "Android Developer Intern (Summer Internship)",
      "description": "Developed Android applications using Java and Android Studio. Learned mobile app development lifecycle and best practices"
    }
  ],
  "academicProjects": [
    {
      "title": "Gift Recommendation Website",
      "description": "Developed a collaborative web platform with a team of 5 members. Created recommendation engine for gift suggestions based on relationships. Implemented user-friendly interface for easy gift discovery and selection."
    },
    {
      "title": "ExamPaper Management System",
      "description": "Built digital repository for exam question papers with permanent database storage. Developed categorization system by subject, exam type, branch, and semester. Enabled easy upload and retrieval functionality for faculty and students."
    }
  ]
}
